#+TITLE:   GNU/Emacs configuration file
#+AUTHOR:  Steve Kemp
#+EMAIL:   steve@steve.fi
#+OPTIONS: num:nil html-postamble:nil

This is an initialization file which is loaded when we start, it is designed to allow me to easily resync the contents of some of our local packages with their remote/upstream sources.

* Easily Updating Emacs Lisp Libraries

Emacs has a concept of a package-registry but the random packages I use aren't contained within that registry, instead they come from Github repositories.

To allow me to easily fetch the latest version of those packages I've defined a table containing the remote URL to the file, and the destination to which it should be written beneath this directory.

To resync all the files place the cursor on the bottom-row of the table and execute `C-c C-c` to run =org-ctrl-c-ctrl-c=, which will apply the formulate to each table-row, invoking the custom =download= function in the process.

This is a bit terrible, but also a bit awesome.

#+NAME: github-urls
| Destination                       | Link                                                                                          | Result |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/cfengine.el       | https://raw.githubusercontent.com/cfengine/core/master/contrib/cfengine.el                    |   1496 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/go-mode.el        | https://raw.githubusercontent.com/dominikh/go-mode.el/master/go-mode.el                       |   3055 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/groovy-mode.el    | https://raw.githubusercontent.com/Groovy-Emacs-Modes/groovy-emacs-modes/master/groovy-mode.el |   1018 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/lua-mode.el       | https://raw.githubusercontent.com/immerrr/lua-mode/master/lua-mode.el                         |   2293 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/markdown-mode.el  | https://raw.githubusercontent.com/jrblevin/markdown-mode/master/markdown-mode.el              |   9996 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/monkey.el         | https://raw.githubusercontent.com/skx/monkey/master/emacs/monkey.el                           |     96 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/puppet-mode.el    | https://raw.githubusercontent.com/voxpupuli/puppet-mode/master/puppet-mode.el                 |   1293 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/terraform-mode.el | https://raw.githubusercontent.com/syohex/emacs-terraform-mode/master/terraform-mode.el        |    346 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/lang/web-mode.el       | https://raw.githubusercontent.com/fxbois/web-mode/master/web-mode.el                          |  14897 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/org/org-autolist.el    | https://raw.githubusercontent.com/calvinwyoung/org-autolist/master/org-autolist.el            |    232 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/org/org-diary.el       | https://raw.githubusercontent.com/skx/org-diary/master/org-diary.el                           |    183 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/org/org-nested.el      | https://raw.githubusercontent.com/skx/org-nested/master/org-nested.el                         |     37 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/org/org-tag-cloud.el   | https://raw.githubusercontent.com/skx/org-tag-cloud/master/org-tag-cloud.el                   |     61 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/org/org-appear.el      | https://raw.githubusercontent.com/awth13/org-appear/master/org-appear.el                      |    426 |
|-----------------------------------+-----------------------------------------------------------------------------------------------+--------|
| ~/.emacs.d/ui/smex.el             | https://raw.githubusercontent.com/nonsequitur/smex/master/smex.el                             |    483 |
#+TBLFM: $3='(download $2 $1)

#+BEGIN_SRC emacs-lisp :results output silent
  (defun download (url dest)
    "Download the given URL and save the contents to the specified destination-file."
    (if (length url)
      (progn
        (shell-command-to-string (concat "wget -O " dest " " url))
        (shell-command-to-string (concat "wc -l " (expand-file-name dest) " | awk '{print $1}' | tr -d \\\\n")))
    (message "%s empty" url)))
#+END_SRC
